tap "jesseduffield/lazygit"
brew "chezmoi"
brew "cmake"
brew "cocoapods"
brew "direnv"
brew "fzf"
brew "gcc"
brew "git-lfs"
brew "go"
brew "gradle"
brew "hugo"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "ollama"
brew "p7zip"
brew "pkgconf"
brew "protobuf"
brew "pyenv"
brew "telnet"
brew "tig"
brew "wget"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "kitty"
vscode "1yib.rust-bundle"
vscode "alibaba-cloud.tongyi-lingma"
vscode "bbenoist.nix"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "jnoortheen.nix-ide"
vscode "johnsoncodehk.vscode-tsslint"
vscode "leetcode.vscode-leetcode"
vscode "marscode.marscode-extension"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "nucllear.vscode-extension-auto-import"
vscode "pbkit.vscode-pbkit"
vscode "plex.vscode-protolint"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "svelte.svelte-vscode"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
